//=============================================================================
//
// 背景処理 [bgBlack.h]
// Author : 
//
//=============================================================================

#ifndef _BGblack_H_
#define _BGblack_H_
// マクロ定義
#define TEXTURE_BG_SIZE_X	(512)	// テクスチャサイズ
#define TEXTURE_BG_SIZE_Y	(512)	// 
//アニメーション
#define TEXTURE_BG_DIVIDE_X	(1)	// アニメパターンのテクスチャ内分割数（X)
#define TEXTURE_BG_DIVIDE_Y	(1)	// アニメパターンのテクスチャ内分割数（Y)


//***************************BG**************************************************
// プロトタイプ宣言
//*****************************************************************************
void InitBgBlack();
void UninitBgBlack();
void DrawBgBlack();
#endif

