//=====================================================================================
//
// 当たり判定処理 [collision.h]
// Author : 秋本
//接触判定と、接触後どの関数を呼ぶか記述
//game.cppのみインクルードされる
//=============================================================================

#pragma once
#include "main.h"

typedef struct
{
	float cx, cy;	//中心座標
	float r;		//半径

}CIRCLE;


typedef struct
{
	float x, y;		//始点座標
	float ex, ey;	//ベクトル方向（終点）
	float r;		//半径

}CAPSULE;

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************

void HitCheck(void);

